__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 120, 160, 3)  0                                            
__________________________________________________________________________________________________
conv_1 (Conv2D)                 (None, 120, 160, 8)  216         input_1[0][0]                    
__________________________________________________________________________________________________
norm_1 (BatchNormalization)     (None, 120, 160, 8)  32          conv_1[0][0]                     
__________________________________________________________________________________________________
leaky_relu_1 (LeakyReLU)        (None, 120, 160, 8)  0           norm_1[0][0]                     
__________________________________________________________________________________________________
conv_2 (Conv2D)                 (None, 120, 160, 8)  576         leaky_relu_1[0][0]               
__________________________________________________________________________________________________
norm_2 (BatchNormalization)     (None, 120, 160, 8)  32          conv_2[0][0]                     
__________________________________________________________________________________________________
leaky_relu_2 (LeakyReLU)        (None, 120, 160, 8)  0           norm_2[0][0]                     
__________________________________________________________________________________________________
conv_3 (Conv2D)                 (None, 120, 160, 16) 1152        leaky_relu_2[0][0]               
__________________________________________________________________________________________________
norm_3 (BatchNormalization)     (None, 120, 160, 16) 64          conv_3[0][0]                     
__________________________________________________________________________________________________
leaky_relu_3 (LeakyReLU)        (None, 120, 160, 16) 0           norm_3[0][0]                     
__________________________________________________________________________________________________
max_pool_3 (MaxPooling2D)       (None, 60, 80, 16)   0           leaky_relu_3[0][0]               
__________________________________________________________________________________________________
conv_4 (Conv2D)                 (None, 60, 80, 32)   4608        max_pool_3[0][0]                 
__________________________________________________________________________________________________
norm_4 (BatchNormalization)     (None, 60, 80, 32)   128         conv_4[0][0]                     
__________________________________________________________________________________________________
leaky_relu_4 (LeakyReLU)        (None, 60, 80, 32)   0           norm_4[0][0]                     
__________________________________________________________________________________________________
max_pool_4 (MaxPooling2D)       (None, 30, 40, 32)   0           leaky_relu_4[0][0]               
__________________________________________________________________________________________________
conv_5 (Conv2D)                 (None, 30, 40, 64)   18432       max_pool_4[0][0]                 
__________________________________________________________________________________________________
norm_5 (BatchNormalization)     (None, 30, 40, 64)   256         conv_5[0][0]                     
__________________________________________________________________________________________________
leaky_relu_5 (LeakyReLU)        (None, 30, 40, 64)   0           norm_5[0][0]                     
__________________________________________________________________________________________________
max_pool_5 (MaxPooling2D)       (None, 15, 20, 64)   0           leaky_relu_5[0][0]               
__________________________________________________________________________________________________
conv_6 (Conv2D)                 (None, 15, 20, 64)   36864       max_pool_5[0][0]                 
__________________________________________________________________________________________________
norm_6 (BatchNormalization)     (None, 15, 20, 64)   256         conv_6[0][0]                     
__________________________________________________________________________________________________
leaky_relu_6 (LeakyReLU)        (None, 15, 20, 64)   0           norm_6[0][0]                     
__________________________________________________________________________________________________
max_pool_6 (MaxPooling2D)       (None, 15, 20, 64)   0           leaky_relu_6[0][0]               
__________________________________________________________________________________________________
conv_7 (Conv2D)                 (None, 15, 20, 128)  73728       max_pool_6[0][0]                 
__________________________________________________________________________________________________
norm_7 (BatchNormalization)     (None, 15, 20, 128)  512         conv_7[0][0]                     
__________________________________________________________________________________________________
leaky_relu_7 (LeakyReLU)        (None, 15, 20, 128)  0           norm_7[0][0]                     
__________________________________________________________________________________________________
conv_skip (Conv2D)              (None, 15, 20, 128)  8192        max_pool_6[0][0]                 
__________________________________________________________________________________________________
conv_8 (Conv2D)                 (None, 15, 20, 256)  294912      leaky_relu_7[0][0]               
__________________________________________________________________________________________________
norm_skip (BatchNormalization)  (None, 15, 20, 128)  512         conv_skip[0][0]                  
__________________________________________________________________________________________________
norm_8 (BatchNormalization)     (None, 15, 20, 256)  1024        conv_8[0][0]                     
__________________________________________________________________________________________________
leaky_relu_skip (LeakyReLU)     (None, 15, 20, 128)  0           norm_skip[0][0]                  
__________________________________________________________________________________________________
leaky_relu_8 (LeakyReLU)        (None, 15, 20, 256)  0           norm_8[0][0]                     
__________________________________________________________________________________________________
concat (Concatenate)            (None, 15, 20, 384)  0           leaky_relu_skip[0][0]            
                                                                 leaky_relu_8[0][0]               
__________________________________________________________________________________________________
conv_9 (Conv2D)                 (None, 15, 20, 10)   3850        concat[0][0]                     
==================================================================================================
Total params: 445,346
Trainable params: 443,938
Non-trainable params: 1,408
__________________________________________________________________________________________________