_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 24)                72        
_________________________________________________________________
dense_2 (Dense)              (None, 24)                600       
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 75        
=================================================================
Total params: 747
Trainable params: 747
Non-trainable params: 0
_________________________________________________________________